DROP TABLE IF EXISTS students, campus, dormitory5 CASCADE;
CREATE TABLE students(
	student_id int,
	last_name text,
	first_name text,
	patronimic text,
	faculty text,
	study_group int
	);

CREATE TABLE students_accommodation(
	student_id INT REFERENCES students(student_id), -- связывает с прошлой таблицей по номеру зачётки
	domitory_number text,
	room_number text,
	contract_number int,
	contract_start_date date,
	contract_expire_date date
);


INSERT INTO students (student_id, last_name, first_name, patronimic, faculty, study_group)
VALUES
  (1, 'Иванов', 'Иван', 'Иванович', 'ФИТ', 22101),
  (2, 'Петров', 'Петр', 'Петрович', 'ФИТ', 22201),
  (3, 'Сидорова', 'Анна', 'Игоревна', 'ФИТ', 22301),
  (4, 'Козлов', 'Дмитрий', 'Александрович', 'ФИТ', 22401),
  (5, 'Смирнов', 'Алексей', 'Николаевич', 'ФИТ', 22501),
  (6, 'Новикова', 'Мария', 'Дмитриевна', 'ФИТ', 22601),
  (7, 'Лебедев', 'Артем', 'Сергеевич', 'ФИТ', 22701),
  (8, 'Васнецов', 'Александр', 'Игоревич', 'ФИТ', 2801),
  (9, 'Тимофеев', 'Арсений', 'Владимирович', 'ФИТ', 2901),
  (10, 'Кузнецов', 'Олег', 'Васильевич', 'ФИТ', 21001),
  (11, 'Белова', 'Татьяна', 'Денисовна', 'ФИТ', 21101),
  (12, 'Шевченко', 'Екатерина', 'Сергеевна', 'ФИТ', 21201),
  (13, 'Морозов', 'Владислав', 'Александрович', 'ФИТ', 21301),
  (14, 'Калинина', 'Людмила', 'Павловна', 'ФИТ', 21401),
  (15, 'Романов', 'Андрей', 'Андреевич', 'ФИТ', 21501),
  (16, 'Королева', 'Ольга', 'Сергеевна', 'ФИТ', 21601),
  (17, 'Воронов', 'Игорь', 'Николаевич', 'ФИТ', 21701),
  (18, 'Поляков', 'Станислав', 'Викторович', 'ФИТ', 21801),
  (19, 'Кудряшова', 'Виктория', 'Анатольевна', 'ФИТ', 21901),
  (20, 'Соловьев', 'Артур', 'Александрович', 'ФИТ', 22001);


INSERT INTO students_accommodation (student_id, dormitory_number, room_number, contract_number, contract_start_date, contract_expire_date)
VALUES
  (1, '5', '101B', 1234, '2023-01-01', '2023-12-31'),
  (2, '5', '201B', 5678, '2023-01-15', '2023-12-15'),
  (3, '5', '301B', 9876, '2023-02-01', '2023-11-30'),
  (4, '5', '102M', 3456, '2023-03-01', '2023-10-31'),
  (5, '5', '202M', 7890, '2023-03-15', '2023-10-15'),
  (6, '5', '302B', 2345, '2023-04-01', '2023-09-30'),
  (7, '5', '103M', 6789, '2023-05-01', '2023-08-31'),
  (8, '5', '203B', 4321, '2023-05-15', '2023-08-15'),
  (9, '5', '303B', 5678, '2023-06-01', '2023-07-31'),
  (10, '5', '104M', 9012, '2023-07-01', '2023-12-01'),
  (11, '5', '204B', 1234, '2023-08-15', '2023-12-15'),
  (12, '5', '304B', 5678, '2023-09-01', '2023-11-30'),
  (13, '5', '105B', 9012, '2023-10-01', '2023-12-31'),
  (14, '5', '205B', 1234, '2023-11-15', '2023-12-15'),
  (15, '5', '305B', 5678, '2023-12-01', '2023-12-31'),
  (16, '5', '106M', 9012, '2024-01-01', '2024-06-01'),
  (17, '5', '206M', 1234, '2024-01-15', '2024-06-15'),
  (18, '5', '306B', 5678, '2024-02-01', '2024-05-31'),
  (19, '5', '107B', 9012, '2024-03-01', '2024-05-31'),
  (20, '5', '207B', 1234, '2024-04-15', '2024-05-15');

CREATE TABLE campus(domitory_number text);

--INSERT INTO campus(domitory_number)
--VALUES('1A'), ('1B'), ('4'), ('5'), ('6'), ('7'), ('8/1'), ('8/2'), ('9'), ('10');


CREATE TABLE dormitory5 (
	floor int,
	room_number text,
	capacity int,
	id1 int,
	id2 int,
	id3 int,
	id4 int,
	id5 int
);
--INSERT INTO dormitory5(floor, room_number, capacity, id1, id2, id3, id4))
--VALUES(1, '110B', 3, 2, 3), ('110S', 1, 1), ('111B', 3), ('111S',1), ('112S',1), ('112B',3);